In [1]:
import sqlite3

con = sqlite3.connect("firstDB.db", check_same_thread=False)
cursor = con.cursor()

cursor.execute('''CREATE TABLE IF NOT EXISTS workers (
                    id INTEGER PRIMARY KEY AUTOINCREMENT,
                    name TEXT,
                    age INTEGER,
                    salary integer
                )''')
cursor.execute("INSERT INTO workers (name, age, salary) VALUES ('Ладюша', 18, 400)")

In [4]:
# данные для добавления

names = ['Диляра', 'Лейла', 'Аделина', 'Элина', 'Аня', 'Эльза', 'Амалия', 'Соня', 'Карина', 'Луиза', 'Настя', 'Иделия']
ages = [18, 17, 14, 16, 19, 15, 17, 18, 16, 16, 18, 14, 19]
salaries = [400, 500, 500, 1000, 500, 1000, 2000, 1700, 2540, 1890, 2570, 1698, 2578]
workers_list = [x for x in zip(names, ages, salaries)]
cursor.executemany("INSERT INTO workers (name, age, salary) VALUES (?, ?, ?)", workers_list)

In [6]:
cursor.execute("""
    SELECT * FROM workers
""")
results = cursor.fetchall()
print(results)

[(1, 'Ладюша', 18, 400), (2, 'Диляра', 18, 400), (3, 'Лейла', 17, 500), (4, 'Аделина', 14, 500), (5, 'Элина', 16, 1000), (6, 'Аня', 19, 500), (7, 'Эльза', 15, 1000), (8, 'Амалия', 17, 2000), (9, 'Соня', 18, 1700), (10, 'Карина', 16, 2540), (11, 'Луиза', 16, 1890), (12, 'Настя', 18, 2570), (13, 'Иделия', 14, 1698), (14, 'Диляра', 18, 400), (15, 'Лейла', 17, 500), (16, 'Аделина', 14, 500), (17, 'Элина', 16, 1000), (18, 'Аня', 19, 500), (19, 'Эльза', 15, 1000), (20, 'Амалия', 17, 2000), (21, 'Соня', 18, 1700), (22, 'Карина', 16, 2540), (23, 'Луиза', 16, 1890), (24, 'Настя', 18, 2570), (25, 'Иделия', 14, 1698)]

In [7]:
cursor.execute("""
    SELECT name, age, salary FROM workers
    WHERE id <= 6
""")
results = cursor.fetchall()
print(results)

[('Ладюша', 18, 400), ('Диляра', 18, 400), ('Лейла', 17, 500), ('Аделина', 14, 500), ('Элина', 16, 1000), ('Аня', 19, 500)]

In [12]:
cursor.execute("""
    SELECT name, age, salary FROM workers
    WHERE id <= 5 AND id >= 2
""")
results = cursor.fetchall()
print(results)

[('Диляра', 18, 400), ('Лейла', 17, 500), ('Аделина', 14, 500), ('Элина', 16, 1000)]

In [16]:
cursor.execute("""
    SELECT name, age, salary FROM workers
    ORDER BY salary
""")
results = cursor.fetchall()
for worker in results:
    print(*worker)

Ладюша 18 400
Диляра 18 400
Диляра 18 400
Лейла 17 500
Аделина 14 500
Аня 19 500
Лейла 17 500
Аделина 14 500
Аня 19 500
Элина 16 1000
Эльза 15 1000
Элина 16 1000
Эльза 15 1000
Иделия 14 1698
Иделия 14 1698
Соня 18 1700
Соня 18 1700
Луиза 16 1890
Луиза 16 1890
Амалия 17 2000
Амалия 17 2000
Карина 16 2540
Карина 16 2540
Настя 18 2570
Настя 18 2570

In [17]:
cursor.execute("""
    SELECT name, age, salary FROM workers
    ORDER BY salary DESC
""")
results = cursor.fetchall()
for worker in results:
    print(*worker)

Настя 18 2570
Настя 18 2570
Карина 16 2540
Карина 16 2540
Амалия 17 2000
Амалия 17 2000
Луиза 16 1890
Луиза 16 1890
Соня 18 1700
Соня 18 1700
Иделия 14 1698
Иделия 14 1698
Элина 16 1000
Эльза 15 1000
Элина 16 1000
Эльза 15 1000
Лейла 17 500
Аделина 14 500
Аня 19 500
Лейла 17 500
Аделина 14 500
Аня 19 500
Ладюша 18 400
Диляра 18 400
Диляра 18 400

In [18]:
cursor.execute("""
    SELECT name, age, salary FROM workers
    WHERE id >= 2 AND id <= 6
    ORDER BY salary
""")
results = cursor.fetchall()
for worker in results:
    print(*worker)

Диляра 18 400
Лейла 17 500
Аделина 14 500
Аня 19 500
Элина 16 1000

In [19]:
cursor.execute("""
    SELECT COUNT(*) FROM workers
""")
results = cursor.fetchall()
for worker in results:
    print(*worker)

25

In [21]:
cursor.execute("""
    SELECT COUNT(*) FROM workers
    WHERE salary == 400
""")
results = cursor.fetchall()
for worker in results:
    print(*worker)

3

In [22]:
cursor.execute('''CREATE TABLE IF NOT EXISTS pages (
                    id INTEGER PRIMARY KEY AUTOINCREMENT,
                    author TEXT,
                    article TEXT,
                    age integer
                )''')

In [27]:
authors = ["Artem", "Kamol", "Daniil", "Lev", "Ilnar", "Bulat", "Ilya"]
article = ["В своей статье рассказывает о статьях", "Написал статью об инфляции", "Придумал новый химический элемент", "Также писал о машинах", "Написал статью о том, как разрабатывать элементы дизайна", "Написал статью о своей девушке", "Также писал о девушке"]
age = [18 for _ in range(len(authors))]
pages_list = [x for x in zip(authors, article, age)]
cursor.executemany("INSERT INTO pages (author, article, age) VALUES (?, ?, ?)", pages_list)

In [32]:
cursor.execute("""
    SELECT * FROM pages
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

1, Artem, В своей статье рассказывает о статьях, 18
2, Kamol, Написал статью об инфляции, 18
3, Daniil, Придумал новый химический элемент, 18
4, Lev, Также писал о машинах, 18
5, Ilnar, Написал статью о том, как разрабатывать элементы дизайна, 18
6, Bulat, Написал статью о своей девушке, 18
7, Ilya, Также писал о девушке, 18

In [36]:
cursor.execute("""
    SELECT * FROM pages
    WHERE author LIKE '_%a%_'
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

2, Kamol, Написал статью об инфляции, 18
3, Daniil, Придумал новый химический элемент, 18
5, Ilnar, Написал статью о том, как разрабатывать элементы дизайна, 18
6, Bulat, Написал статью о своей девушке, 18

In [43]:
cursor.execute("""
    SELECT article FROM pages
    WHERE article LIKE '%элемент%'
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

Придумал новый химический элемент
Написал статью о том, как разрабатывать элементы дизайна

In [47]:
cursor.execute("""
    SELECT * FROM workers
    WHERE name LIKE '%я'
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

6, Аня, 19, 500
8, Амалия, 17, 2000
9, Соня, 18, 1700
12, Настя, 18, 2570
13, Иделия, 14, 1698
18, Аня, 19, 500
20, Амалия, 17, 2000
21, Соня, 18, 1700
24, Настя, 18, 2570
25, Иделия, 14, 1698

In [49]:
cursor.execute("""
    SELECT * FROM workers
    WHERE id == 3
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

3, Лейла, 17, 500

In [50]:
cursor.execute("""
    SELECT * FROM workers
    WHERE salary == 1000
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

5, Элина, 16, 1000
7, Эльза, 15, 1000
17, Элина, 16, 1000
19, Эльза, 15, 1000

In [51]:
cursor.execute("""
    SELECT * FROM workers
    WHERE age == 23
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

In [55]:
cursor.execute("""
    SELECT * FROM workers
    WHERE name == 'Аделина'
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

4, Аделина, 14, 500
16, Аделина, 14, 500

In [56]:
cursor.execute("""
    SELECT * FROM workers
    WHERE name == 'Аделина' OR name == 'Настя'
""")
results = cursor.fetchall()
for worker in results:
    print(*worker, sep=', ')

4, Аделина, 14, 500
12, Настя, 18, 2570
16, Аделина, 14, 500
24, Настя, 18, 2570

In [58]:
cursor.execute("INSERT INTO workers (name, age, salary) VALUES ('Никита', 26, 300)")
cursor.execute("INSERT INTO workers (name, age, salary) VALUES ('Светлана', 0, 1200)")
cursor.execute("INSERT INTO workers (name, age, salary) VALUES ('Борис', -100, 0)")

In [59]:
cursor.execute("DELETE FROM workers WHERE name == 'Борис'")

In [60]:
cursor.execute("DELETE FROM workers WHERE name == 'Лев'")

In [ ]:
cursor.execute("UPDATE workers SET salary = 3000 WHERE ")